tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf24k40_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF24K40_H_
#define _PIC18LF24K40_H_

#define PPSLOCK                       0
#define PPSLOCKED                     1
#define INT0PPS0                      2
#define INT0PPS                       3
#define INT0PPS1                      4
#define INT0PPS2                      5
#define INT0PPS3                      6
#define INT0PPS4                      7
#define INT1PPS                       8
#define INT1PPS0                      9
#define INT1PPS1                      10
#define INT1PPS2                      11
#define INT1PPS3                      12
#define INT1PPS4                      13
#define INT2PPS0                      14
#define INT2PPS                       15
#define INT2PPS1                      16
#define INT2PPS2                      17
#define INT2PPS3                      18
#define INT2PPS4                      19
#define T0CKIPPS0                     20
#define T0CKIPPS                      21
#define T0CKIPPS1                     22
#define T0CKIPPS2                     23
#define T0CKIPPS3                     24
#define T0CKIPPS4                     25
#define T1CKIPPS0                     26
#define T1CKIPPS                      27
#define T1CKIPPS1                     28
#define T1CKIPPS2                     29
#define T1CKIPPS3                     30
#define T1CKIPPS4                     31
#define T1GPPS0                       32
#define T1GPPS                        33
#define T1GPPS1                       34
#define T1GPPS2                       35
#define T1GPPS3                       36
#define T1GPPS4                       37
#define T3CKIPPS0                     38
#define T3CKIPPS                      39
#define T3CKIPPS1                     40
#define T3CKIPPS2                     41
#define T3CKIPPS3                     42
#define T3CKIPPS4                     43
#define T3GPPS0                       44
#define T3GPPS                        45
#define T3GPPS1                       46
#define T3GPPS2                       47
#define T3GPPS3                       48
#define T3GPPS4                       49
#define T5CKIPPS0                     50
#define T5CKIPPS                      51
#define T5CKIPPS1                     52
#define T5CKIPPS2                     53
#define T5CKIPPS3                     54
#define T5CKIPPS4                     55
#define T5GPPS                        56
#define T5GPPS0                       57
#define T5GPPS1                       58
#define T5GPPS2                       59
#define T5GPPS3                       60
#define T5GPPS4                       61
#define T2INPPS                       62
#define T2INPPS0                      63
#define T2INPPS1                      64
#define T2INPPS2                      65
#define T2INPPS3                      66
#define T2INPPS4                      67
#define T4INPPS0                      68
#define T4INPPS                       69
#define T4INPPS1                      70
#define T4INPPS2                      71
#define T4INPPS3                      72
#define T4INPPS4                      73
#define T6INPPS0                      74
#define T6INPPS                       75
#define T6INPPS1                      76
#define T6INPPS2                      77
#define T6INPPS3                      78
#define T6INPPS4                      79
#define ADACTPPS                      80
#define ADACTPPS0                     81
#define ADACTPPS1                     82
#define ADACTPPS2                     83
#define ADACTPPS3                     84
#define ADACTPPS4                     85
#define CCP1PPS0                      86
#define CCP1PPS                       87
#define CCP1PPS1                      88
#define CCP1PPS2                      89
#define CCP1PPS3                      90
#define CCP1PPS4                      91
#define CCP2PPS0                      92
#define CCP2PPS                       93
#define CCP2PPS1                      94
#define CCP2PPS2                      95
#define CCP2PPS3                      96
#define CCP2PPS4                      97
#define CWGINPPS                      98
#define CWGINPPS0                     99
#define CWG1INPPS0                    100
#define CWG1INPPS                     101
#define CWGINPPS1                     102
#define CWG1INPPS1                    103
#define CWGINPPS2                     104
#define CWG1INPPS2                    105
#define CWGINPPS3                     106
#define CWG1INPPS3                    107
#define CWGINPPS4                     108
#define CWG1INPPS4                    109
#define MDCARLPPS                     110
#define MDCARLPPS0                    111
#define MDCARLPPS1                    112
#define MDCARLPPS2                    113
#define MDCARLPPS3                    114
#define MDCARLPPS4                    115
#define MDCARHPPS0                    116
#define MDCARHPPS                     117
#define MDCARHPPS1                    118
#define MDCARHPPS2                    119
#define MDCARHPPS3                    120
#define MDCARHPPS4                    121
#define MDSRCPPS0                     122
#define MDSRCPPS                      123
#define MDSRCPPS1                     124
#define MDSRCPPS2                     125
#define MDSRCPPS3                     126
#define MDSRCPPS4                     127
#define RXPPS0                        128
#define RXPPS                         129
#define RXPPS1                        130
#define RXPPS2                        131
#define RXPPS3                        132
#define RXPPS4                        133
#define TXPPS0                        134
#define TXPPS                         135
#define TXPPS1                        136
#define TXPPS2                        137
#define TXPPS3                        138
#define TXPPS4                        139
#define SSPCLKPPS                     140
#define SSPCLKPPS0                    141
#define SSP1CLKPPS0                   142
#define SSP1CLKPPS                    143
#define SSP1CLKPPS1                   144
#define SSPCLKPPS1                    145
#define SSPCLKPPS2                    146
#define SSP1CLKPPS2                   147
#define SSPCLKPPS3                    148
#define SSP1CLKPPS3                   149
#define SSPCLKPPS4                    150
#define SSP1CLKPPS4                   151
#define SSP1DATPPS0                   152
#define SSP1DATPPS                    153
#define SSPDATPPS                     154
#define SSPDATPPS0                    155
#define SSP1DATPPS1                   156
#define SSPDATPPS1                    157
#define SSP1DATPPS2                   158
#define SSPDATPPS2                    159
#define SSP1DATPPS3                   160
#define SSPDATPPS3                    161
#define SSP1DATPPS4                   162
#define SSPDATPPS4                    163
#define SSPSSPPS0                     164
#define SSP1SSPPS                     165
#define SSPSSPPS                      166
#define SSP1SSPPS0                    167
#define SSPSSPPS1                     168
#define SSP1SSPPS1                    169
#define SSPSSPPS2                     170
#define SSP1SSPPS2                    171
#define SSPSSPPS3                     172
#define SSP1SSPPS3                    173
#define SSPSSPPS4                     174
#define SSP1SSPPS4                    175
#define IPR0                          176
#define INT0IP                        177
#define INT1IP                        178
#define INT2IP                        179
#define IOCIP                         180
#define TMR0IP                        181
#define IPR1                          182
#define ADIP                          183
#define ADTIP                         184
#define CSWIP                         185
#define OSCFIP                        186
#define PSPIP                         187
#define IPR2                          188
#define C1IP                          189
#define C2IP                          190
#define ZCDIP                         191
#define CMIP                          192
#define HLVDIP                        193
#define IPR3                          194
#define SSPIP                         195
#define SSP1IP                        196
#define BCLIP                         197
#define RXBNIP                        198
#define BCL1IP                        199
#define TXBNIP                        200
#define TXIP                          201
#define RCIP                          202
#define IPR4                          203
#define TMR1IP                        204
#define CCIP3IP                       205
#define TMR2IP                        206
#define TMR3IP                        207
#define TMR4IP                        208
#define TMR5IP                        209
#define TMR6IP                        210
#define IPR5                          211
#define TMR1GIP                       212
#define CCH05                         213
#define TMR3GIP                       214
#define CCH15                         215
#define TMR5GIP                       216
#define IPR6                          217
#define CCP1IP                        218
#define CCP2IP                        219
#define IPR7                          220
#define CWG1IP                        221
#define CWGIP                         222
#define NVMIP                         223
#define CRCIP                         224
#define SCANIP                        225
#define PIE0                          226
#define INT0IE                        227
#define INT1IE                        228
#define INT2IE                        229
#define IOCIE                         230
#define TMR0IE                        231
#define PIE1                          232
#define ADIE                          233
#define ADTIE                         234
#define CSWIE                         235
#define OSCFIE                        236
#define PSPIE                         237
#define PIE2                          238
#define C1IE                          239
#define C2IE                          240
#define ZCDIE                         241
#define CMIE                          242
#define HLVDIE                        243
#define PIE3                          244
#define SSPIE                         245
#define SSP1IE                        246
#define RXB0IE                        247
#define BCLIE                         248
#define BCL1IE                        249
#define RXBNIE                        250
#define RXB1IE                        251
#define TXBNIE                        252
#define TXIE                          253
#define TXB2IE                        254
#define RCIE                          255
#define PIE4                          256
#define TMR1IE                        257
#define TMR2IE                        258
#define TMR3IE                        259
#define TMR4IE                        260
#define TMR5IE                        261
#define TMR6IE                        262
#define PIE5                          263
#define TMR1GIE                       264
#define TMR3GIE                       265
#define TMR5GIE                       266
#define PIE6                          267
#define CCP1IE                        268
#define CCP2IE                        269
#define PIE7                          270
#define CWGIE                         271
#define CWG1IE                        272
#define NVMIE                         273
#define CRCIE                         274
#define SCANIE                        275
#define PIR0                          276
#define INT0IF                        277
#define INT1IF                        278
#define INT2IF                        279
#define IOCIF                         280
#define TMR0IF                        281
#define PIR1                          282
#define ADIF                          283
#define ADTIF                         284
#define CSWIF                         285
#define OSCFIF                        286
#define PSPIF                         287
#define PIR2                          288
#define C1IF                          289
#define C2IF                          290
#define ZCDIF                         291
#define CMIF                          292
#define HLVDIF                        293
#define PIR3                          294
#define SSP1IF                        295
#define SSPIF                         296
#define RXBNIF                        297
#define BCLIF                         298
#define BCL1IF                        299
#define TXIF                          300
#define TXBNIF                        301
#define RCIF                          302
#define PIR4                          303
#define TMR1IF                        304
#define TMR2IF                        305
#define TMR3IF                        306
#define TMR4IF                        307
#define TMR5IF                        308
#define TMR6IF                        309
#define PIR5                          310
#define TMR1GIF                       311
#define TMR3GIF                       312
#define TMR5GIF                       313
#define PIR6                          314
#define CCP1IF                        315
#define CCP2IF                        316
#define PIR7                          317
#define CWGIF                         318
#define CWG1IF                        319
#define NVMIF                         320
#define CRCIF                         321
#define SCANIF                        322
#define WDTCON0                       323
#define WDTCON0_SEN                   324
#define SWDTEN                        325
#define WDTSEN                        326
#define WDTPS                         327
#define WDTPS0                        328
#define WDTPS1                        329
#define WDTPS2                        330
#define WDTPS3                        331
#define WDTPS4                        332
#define WDTCON1                       333
#define WDTWINDOW0                    334
#define WINDOW0                       335
#define WINDOW                        336
#define WDTWINDOW                     337
#define WDTWINDOW1                    338
#define WINDOW1                       339
#define WDTWINDOW2                    340
#define WINDOW2                       341
#define WDTCS                         342
#define WDTCS0                        343
#define WDTCS1                        344
#define WDTCS2                        345
#define WDTPSL                        346
#define WDTPSL_WDTPSCNT               347
#define WDTPSL_PSCNT                  348
#define WDTPSCNT0                     349
#define PSCNT0                        350
#define WDTPSCNT1                     351
#define PSCNT1                        352
#define WDTPSCNT2                     353
#define PSCNT2                        354
#define WDTPSCNT3                     355
#define PSCNT3                        356
#define WDTPSCNT4                     357
#define PSCNT4                        358
#define WDTPSCNT5                     359
#define PSCNT5                        360
#define WDTPSCNT6                     361
#define PSCNT6                        362
#define WDTPSCNT7                     363
#define PSCNT7                        364
#define WDTPSH                        365
#define PSCNT8                        366
#define WDTPSH_WDTPSCNT               367
#define WDTPSH_PSCNT                  368
#define WDTPSCNT8                     369
#define PSCNT9                        370
#define WDTPSCNT9                     371
#define PSCNT10                       372
#define WDTPSCNT10                    373
#define PSCNT11                       374
#define WDTPSCNT11                    375
#define PSCNT12                       376
#define WDTPSCNT12                    377
#define PSCNT13                       378
#define WDTPSCNT13                    379
#define PSCNT14                       380
#define WDTPSCNT14                    381
#define PSCNT15                       382
#define WDTPSCNT15                    383
#define PSCNT16                       384
#define WDTPSCNT16                    385
#define WDTPSCNT17                    386
#define PSCNT17                       387
#define STATE                         388
#define WDTSTATE                      389
#define WDTTMR                        390
#define WDTTMR0                       391
#define WDTTMR1                       392
#define WDTTMR2                       393
#define WDTTMR3                       394
#define WDTTMR4                       395
#define CPUDOZE                       396
#define DOZE0                         397
#define DOZE                          398
#define DOZE1                         399
#define DOZE2                         400
#define DOE                           401
#define ROI                           402
#define DOZEN                         403
#define IDLEN                         404
#define OSCCON1                       405
#define NDIV0                         406
#define NDIV                          407
#define NDIV1                         408
#define NDIV2                         409
#define NDIV3                         410
#define NOSC0                         411
#define NOSC                          412
#define NOSC1                         413
#define NOSC2                         414
#define OSCCON2                       415
#define CDIV0                         416
#define CDIV                          417
#define CDIV1                         418
#define CDIV2                         419
#define CDIV3                         420
#define COSC                          421
#define COSC0                         422
#define COSC1                         423
#define COSC2                         424
#define OSCCON3                       425
#define NOSCR                         426
#define ORDY                          427
#define SOSCPWR                       428
#define CSWHOLD                       429
#define OSCSTAT                       430
#define PLLR                          431
#define ADOR                          432
#define SOR                           433
#define LFOR                          434
#define MFOR                          435
#define HFOR                          436
#define EXTOR                         437
#define OSCEN                         438
#define ADOEN                         439
#define SOSCEN                        440
#define LFOEN                         441
#define MFOEN                         442
#define HFOEN                         443
#define EXTOEN                        444
#define OSCTUNE                       445
#define TUN0                          446
#define TUN                           447
#define TUN1                          448
#define TUN2                          449
#define TUN3                          450
#define TUN4                          451
#define TUN5                          452
#define OSCFRQ                        453
#define HFFRQ                         454
#define FRQ0                          455
#define FRQ1                          456
#define FRQ2                          457
#define FRQ3                          458
#define BORCON                        459
#define BORRDY                        460
#define SBOREN                        461
#define PMD0                          462
#define IOCMD                         463
#define CLKRMD                        464
#define SPI1MD                        465
#define SPI2MD                        466
#define NVMMD                         467
#define SCANMD                        468
#define CRCMD                         469
#define HLVDMD                        470
#define FVRMD                         471
#define SYSCMD                        472
#define PMD1                          473
#define EMBMD                         474
#define TMR0MD                        475
#define TMR1MD                        476
#define TMR2MD                        477
#define TMR3MD                        478
#define TMR4MD                        479
#define TMR5MD                        480
#define TMR6MD                        481
#define PMD2                          482
#define ZCDMD                         483
#define CMP1MD                        484
#define CMP2MD                        485
#define ADCMD                         486
#define DACMD                         487
#define PMD3                          488
#define CCP1MD                        489
#define CCP2MD                        490
#define PWM3MD                        491
#define PWM4MD                        492
#define PMD4                          493
#define CWG1MD                        494
#define CWGMD                         495
#define MSSP1MD                       496
#define UART1MD                       497
#define PMD5                          498
#define DSMMD                         499
#define RA0PPS                        500
#define RA0PPS0                       501
#define RA0PPS1                       502
#define RA0PPS2                       503
#define RA0PPS3                       504
#define RA0PPS4                       505
#define RA1PPS                        506
#define RA1PPS0                       507
#define RA1PPS1                       508
#define RA1PPS2                       509
#define RA1PPS3                       510
#define RA1PPS4                       511
#define RA2PPS                        512
#define RA2PPS0                       513
#define RA2PPS1                       514
#define RA2PPS2                       515
#define RA2PPS3                       516
#define RA2PPS4                       517
#define RA3PPS                        518
#define RA3PPS0                       519
#define RA3PPS1                       520
#define RA3PPS2                       521
