tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf24k40_tdd.h
#define RA3PPS3                       522
#define RA3PPS4                       523
#define RA4PPS                        524
#define RA4PPS0                       525
#define RA4PPS1                       526
#define RA4PPS2                       527
#define RA4PPS3                       528
#define RA4PPS4                       529
#define RA5PPS                        530
#define RA5PPS0                       531
#define RA5PPS1                       532
#define RA5PPS2                       533
#define RA5PPS3                       534
#define RA5PPS4                       535
#define RA6PPS                        536
#define RA6PPS0                       537
#define RA6PPS1                       538
#define RA6PPS2                       539
#define RA6PPS3                       540
#define RA6PPS4                       541
#define RA7PPS                        542
#define RA7PPS0                       543
#define RA7PPS1                       544
#define RA7PPS2                       545
#define RA7PPS3                       546
#define RA7PPS4                       547
#define RB0PPS                        548
#define RB0PPS0                       549
#define RB0PPS1                       550
#define RB0PPS2                       551
#define RB0PPS3                       552
#define RB0PPS4                       553
#define RB1PPS                        554
#define RB1PPS0                       555
#define RB1PPS1                       556
#define RB1PPS2                       557
#define RB1PPS3                       558
#define RB1PPS4                       559
#define RB2PPS                        560
#define RB2PPS0                       561
#define RB2PPS1                       562
#define RB2PPS2                       563
#define RB2PPS3                       564
#define RB2PPS4                       565
#define RB3PPS                        566
#define RB3PPS0                       567
#define RB3PPS1                       568
#define RB3PPS2                       569
#define RB3PPS3                       570
#define RB3PPS4                       571
#define RB4PPS                        572
#define RB4PPS0                       573
#define RB4PPS1                       574
#define RB4PPS2                       575
#define RB4PPS3                       576
#define RB4PPS4                       577
#define RB5PPS                        578
#define RB5PPS0                       579
#define RB5PPS1                       580
#define RB5PPS2                       581
#define RB5PPS3                       582
#define RB5PPS4                       583
#define RB6PPS                        584
#define RB6PPS0                       585
#define RB6PPS1                       586
#define RB6PPS2                       587
#define RB6PPS3                       588
#define RB6PPS4                       589
#define RB7PPS                        590
#define RB7PPS0                       591
#define RB7PPS1                       592
#define RB7PPS2                       593
#define RB7PPS3                       594
#define RB7PPS4                       595
#define RC0PPS                        596
#define RC0PPS0                       597
#define RC0PPS1                       598
#define RC0PPS2                       599
#define RC0PPS3                       600
#define RC0PPS4                       601
#define RC1PPS                        602
#define RC1PPS0                       603
#define RC1PPS1                       604
#define RC1PPS2                       605
#define RC1PPS3                       606
#define RC1PPS4                       607
#define RC2PPS                        608
#define RC2PPS0                       609
#define RC2PPS1                       610
#define RC2PPS2                       611
#define RC2PPS3                       612
#define RC2PPS4                       613
#define RC3PPS                        614
#define RC3PPS0                       615
#define RC3PPS1                       616
#define RC3PPS2                       617
#define RC3PPS3                       618
#define RC3PPS4                       619
#define RC4PPS                        620
#define RC4PPS0                       621
#define RC4PPS1                       622
#define RC4PPS2                       623
#define RC4PPS3                       624
#define RC4PPS4                       625
#define RC5PPS                        626
#define RC5PPS0                       627
#define RC5PPS1                       628
#define RC5PPS2                       629
#define RC5PPS3                       630
#define RC5PPS4                       631
#define RC6PPS                        632
#define RC6PPS0                       633
#define RC6PPS1                       634
#define RC6PPS2                       635
#define RC6PPS3                       636
#define RC6PPS4                       637
#define RC7PPS                        638
#define RC7PPS0                       639
#define RC7PPS1                       640
#define RC7PPS2                       641
#define RC7PPS3                       642
#define RC7PPS4                       643
#define IOCAF                         644
#define IOCAF0                        645
#define IOCAF1                        646
#define IOCAF2                        647
#define IOCAF3                        648
#define IOCAF4                        649
#define IOCAF5                        650
#define IOCAF6                        651
#define IOCAF7                        652
#define IOCAN                         653
#define IOCAN0                        654
#define IOCAN1                        655
#define IOCAN2                        656
#define IOCAN3                        657
#define IOCAN4                        658
#define IOCAN5                        659
#define IOCAN6                        660
#define IOCAN7                        661
#define IOCAP                         662
#define IOCAP0                        663
#define IOCAP1                        664
#define IOCAP2                        665
#define IOCAP3                        666
#define IOCAP4                        667
#define IOCAP5                        668
#define IOCAP6                        669
#define IOCAP7                        670
#define INLVLA                        671
#define INLVLA0                       672
#define INLVLA1                       673
#define INLVLA2                       674
#define INLVLA3                       675
#define INLVLA4                       676
#define INLVLA5                       677
#define INLVLA6                       678
#define INLVLA7                       679
#define SLRCONA                       680
#define SLRA0                         681
#define SLRA1                         682
#define SLRA2                         683
#define SLRA3                         684
#define SLRA4                         685
#define SLRA5                         686
#define SLRA6                         687
#define SLRA7                         688
#define ODCONA                        689
#define ODCA0                         690
#define ODCA1                         691
#define ODCA2                         692
#define ODCA3                         693
#define ODCA4                         694
#define ODCA5                         695
#define ODCA6                         696
#define ODCA7                         697
#define WPUA                          698
#define WPUA0                         699
#define WPUA1                         700
#define WPUA2                         701
#define WPUA3                         702
#define WPUA4                         703
#define WPUA5                         704
#define WPUA6                         705
#define WPUA7                         706
#define ANSELA                        707
#define ANSELA0                       708
#define ANSELA1                       709
#define ANSELA2                       710
#define ANSELA3                       711
#define ANSELA4                       712
#define ANSELA5                       713
#define ANSELA6                       714
#define ANSELA7                       715
#define IOCBF                         716
#define IOCBF0                        717
#define IOCBF1                        718
#define IOCBF2                        719
#define IOCBF3                        720
#define IOCBF4                        721
#define IOCBF5                        722
#define IOCBF6                        723
#define IOCBF7                        724
#define IOCBN                         725
#define IOCBN0                        726
#define IOCBN1                        727
#define IOCBN2                        728
#define IOCBN3                        729
#define IOCBN4                        730
#define IOCBN5                        731
#define IOCBN6                        732
#define IOCBN7                        733
#define IOCBP                         734
#define IOCBP0                        735
#define IOCBP1                        736
#define IOCBP2                        737
#define IOCBP3                        738
#define IOCBP4                        739
#define IOCBP5                        740
#define IOCBP6                        741
#define IOCBP7                        742
#define INLVLB                        743
#define INLVLB0                       744
#define INLVLB1                       745
#define INLVLB2                       746
#define INLVLB3                       747
#define INLVLB4                       748
#define INLVLB5                       749
#define INLVLB6                       750
#define INLVLB7                       751
#define SLRCONB                       752
#define SLRB0                         753
#define SLRB1                         754
#define SLRB2                         755
#define SLRB3                         756
#define SLRB4                         757
#define SLRB5                         758
#define SLRB6                         759
#define SLRB7                         760
#define ODCONB                        761
#define ODCB0                         762
#define ODCB1                         763
#define ODCB2                         764
#define ODCB3                         765
#define ODCB4                         766
#define ODCB5                         767
#define ODCB6                         768
#define ODCB7                         769
#define WPUB                          770
#define WPUB0                         771
#define WPUB1                         772
#define WPUB2                         773
#define WPUB3                         774
#define WPUB4                         775
#define WPUB5                         776
#define WPUB6                         777
#define WPUB7                         778
#define ANSELB                        779
#define ANSELB0                       780
#define ANSELB1                       781
#define ANSELB2                       782
#define ANSELB3                       783
#define ANSELB4                       784
#define ANSELB5                       785
#define ANSELB6                       786
#define ANSELB7                       787
#define IOCCF                         788
#define IOCCF0                        789
#define IOCCF1                        790
#define IOCCF2                        791
#define IOCCF3                        792
#define IOCCF4                        793
#define IOCCF5                        794
#define IOCCF6                        795
#define IOCCF7                        796
#define IOCCN                         797
#define IOCCN0                        798
#define IOCCN1                        799
#define IOCCN2                        800
#define IOCCN3                        801
#define IOCCN4                        802
#define IOCCN5                        803
#define IOCCN6                        804
#define IOCCN7                        805
#define IOCCP                         806
#define IOCCP0                        807
#define IOCCP1                        808
#define IOCCP2                        809
#define IOCCP3                        810
#define IOCCP4                        811
#define IOCCP5                        812
#define IOCCP6                        813
#define IOCCP7                        814
#define INLVLC                        815
#define INLVLC0                       816
#define INLVLC1                       817
#define INLVLC2                       818
#define INLVLC3                       819
#define INLVLC4                       820
#define INLVLC5                       821
#define INLVLC6                       822
#define INLVLC7                       823
#define SLRCONC                       824
#define SLRC0                         825
#define SLRC1                         826
#define SLRC2                         827
#define SLRC3                         828
#define SLRC4                         829
#define SLRC5                         830
#define SLRC6                         831
#define SLRC7                         832
#define ODCONC                        833
#define ODCC0                         834
#define ODCC1                         835
#define ODCC2                         836
#define ODCC3                         837
#define ODCC4                         838
#define ODCC5                         839
#define ODCC6                         840
#define ODCC7                         841
#define WPUC                          842
#define WPUC0                         843
#define WPUC1                         844
#define WPUC2                         845
#define WPUC3                         846
#define WPUC4                         847
#define WPUC5                         848
#define WPUC6                         849
#define WPUC7                         850
#define ANSELC                        851
#define ANSELC0                       852
#define ANSELC1                       853
#define ANSELC2                       854
#define ANSELC3                       855
#define ANSELC4                       856
#define ANSELC5                       857
#define ANSELC6                       858
#define ANSELC7                       859
#define IOCEF                         860
#define IOCEF3                        861
#define IOCEN                         862
#define IOCEN3                        863
#define IOCEP                         864
#define IOCEP3                        865
#define INLVLE                        866
#define INLVLE3                       867
#define WPUE                          868
#define WPUE3                         869
#define HLVDCON0                      870
#define INTL                          871
#define HLVDINTL                      872
#define INTH                          873
#define HLVDINTH                      874
#define RDY                           875
#define HLVDRDY                       876
#define HLVDCON0_OUT                  877
#define HLVDOUT                       878
#define HLVDEN                        879
#define HLVDCON0_EN                   880
#define HLVDCON1                      881
#define HLVDSEL0                      882
#define SEL                           883
#define SEL0                          884
#define HLVDSEL1                      885
#define SEL1                          886
#define HLVDSEL2                      887
#define SEL2                          888
#define HLVDSEL3                      889
#define SEL3                          890
#define FVRCON                        891
#define ADFVR0                        892
#define ADFVR                         893
#define ADFVR1                        894
#define CDAFVR                        895
#define CDAFVR0                       896
#define CDAFVR1                       897
#define TSRNG                         898
#define TSEN                          899
#define FVRRDY                        900
#define FVREN                         901
#define ZCDCON                        902
#define ZCDINTN                       903
#define ZCDINTP                       904
#define ZCDPOL                        905
#define ZCDOUT                        906
#define ZCDSEN                        907
#define DAC1CON0                      908
#define NSS                           909
#define DAC1NSS                       910
#define DAC1PSS0                      911
#define PSS                           912
#define PSS0                          913
#define PSS1                          914
#define DAC1PSS1                      915
#define OE2                           916
#define DAC1OE2                       917
#define OE1                           918
#define DAC1OE1                       919
#define DAC1CON0_EN                   920
#define DAC1EN                        921
#define DAC1CON1                      922
#define DAC1R                         923
#define DAC1R0                        924
#define DAC1R1                        925
#define DAC1R2                        926
#define DAC1R3                        927
#define DAC1R4                        928
#define CM2CON0                       929
#define CM2CON0_SYNC                  930
#define C2SYNC                        931
#define C2HYS                         932
#define CM2CON0_HYS                   933
#define C2POL                         934
#define CM2CON0_POL                   935
#define CM2CON0_OUT                   936
#define C2OUT                         937
#define C2EN                          938
#define CM2CON0_EN                    939
#define CM2CON1                       940
#define C2INTN                        941
#define CM2CON1_INTN                  942
#define CM2CON1_INTP                  943
#define C2INTP                        944
#define CM2NCH                        945
#define C2NCH0                        946
#define CM2NCH_NCH0                   947
#define CM2NCH_NCH                    948
#define C2NCH1                        949
#define CM2NCH_NCH1                   950
#define C2NCH2                        951
#define CM2NCH_NCH2                   952
#define CM2PCH                        953
#define CM2PCH_PCH                    954
#define C2PCH0                        955
#define CM2PCH_PCH0                   956
#define C2PCH1                        957
#define CM2PCH_PCH1                   958
#define C2PCH2                        959
#define CM2PCH_PCH2                   960
#define CM1CON0                       961
#define CM1CON0_SYNC                  962
#define C1SYNC                        963
#define CM1CON0_HYS                   964
#define C1HYS                         965
#define CM1CON0_POL                   966
#define C1POL                         967
#define C1OUT                         968
#define CM1CON0_OUT                   969
#define CM1CON0_EN                    970
#define C1EN                          971
#define CM1CON1                       972
#define C1INTN                        973
#define CM1CON1_INTN                  974
#define CM1CON1_INTP                  975
#define C1INTP                        976
#define CM1NCH                        977
#define C1NCH0                        978
#define CM1NCH_NCH0                   979
#define CM1NCH_NCH                    980
#define C1NCH1                        981
#define CM1NCH_NCH1                   982
#define C1NCH2                        983
#define CM1NCH_NCH2                   984
#define CM1PCH                        985
#define CM1PCH_PCH0                   986
#define C1PCH0                        987
#define CM1PCH_PCH                    988
#define CM1PCH_PCH1                   989
#define C1PCH1                        990
#define CM1PCH_PCH2                   991
#define C1PCH2                        992
#define CMOUT                         993
#define MC1OUT                        994
#define MC2OUT                        995
#define CLKRCON                       996
#define CLKRDIV0                      997
#define DIV                           998
#define DIV0                          999
#define CLKRDIV1                      1000
#define DIV1                          1001
#define DIV2                          1002
#define CLKRDIV2                      1003
#define CLKRCON_DC                    1004
#define CLKRCON_DC0                   1005
#define CLKRDC0                       1006
#define CLKRCON_DC1                   1007
#define CLKRDC1                       1008
#define CLKRCON_EN                    1009
#define CLKREN                        1010
#define CLKRCLK                       1011
#define CLKRCLK0                      1012
#define CLK                           1013
#define CLK0                          1014
#define CLKRCLK1                      1015
#define CLK1                          1016
#define CLKRCLK2                      1017
#define CLK2                          1018
#define CWG1CLKCON                    1019
#define CWG1CLKCON_CS                 1020
#define CWG1CS                        1021
#define CWG1ISM                       1022
#define CWG1ISM0                      1023
#define IS                            1024
#define CWG1ISM1                      1025
#define CWG1ISM2                      1026
#define CWG1ISM3                      1027
#define CWG1DBR0                      1028
#define CWG1DBR                       1029
#define DBR                           1030
#define DBR0                          1031
#define CWG1DBR1                      1032
#define DBR1                          1033
#define CWG1DBR2                      1034
#define DBR2                          1035
#define CWG1DBR3                      1036
#define DBR3                          1037
#define CWG1DBR4                      1038
#define DBR4                          1039
#define CWG1DBR5                      1040
#define DBR5                          1041
#define CWG1DBF                       1042
#define CWG1DBF0                      1043
#define DBF                           1044
#define DBF0                          1045
#define CWG1DBF1                      1046
#define DBF1                          1047
#define CWG1DBF2                      1048
#define DBF2                          1049
#define CWG1DBF3                      1050
#define DBF3                          1051
#define CWG1DBF4                      1052
#define DBF4                          1053
#define DBF5                          1054
#define CWG1DBF5                      1055
#define CWG1CON0                      1056
#define CWG1MODE0                     1057
#define CWG1CON0_MODE                 1058
#define CWG1CON0_MODE0                1059
#define CWG1MODE                      1060
#define CWG1MODE1                     1061
#define CWG1CON0_MODE1                1062
#define CWG1MODE2                     1063
#define CWG1CON0_MODE2                1064
#define LD                            1065
#define CWG1LD                        1066
#define CWG1EN                        1067
#define G1EN                          1068
#define CWG1CON0_EN                   1069
#define CWG1CON1                      1070
#define CWG1POLA                      1071
#define POLA                          1072
#define CWG1POLB                      1073
#define POLB                          1074
#define CWG1POLC                      1075
#define POLC                          1076
#define CWG1POLD                      1077
#define POLD                          1078
#define IN                            1079
#define CWG1IN                        1080
#define CWG1AS0                       1081
#define CWG1LSAC                      1082
#define LSAC                          1083
#define LSAC0                         1084
#define CWG1LSAC0                     1085
#define LSAC1                         1086
#define CWG1LSAC1                     1087
#define LSBD0                         1088
#define CWG1LSBD0                     1089
#define LSBD                          1090
