tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf24k40_tdd.h
#define CWG1LSBD                      1091
#define LSBD1                         1092
#define CWG1LSBD1                     1093
#define CWG1REN                       1094
#define REN                           1095
#define CWG1SHUTDOWN                  1096
#define SHUTDOWN                      1097
#define CWG1AS1                       1098
#define AS0E                          1099
#define AS1E                          1100
#define AS2E                          1101
#define AS3E                          1102
#define AS4E                          1103
#define AS5E                          1104
#define CWG1STR                       1105
#define CWG1STRA                      1106
#define STRA                          1107
#define STRB                          1108
#define CWG1STRB                      1109
#define CWG1STRC                      1110
#define STRC                          1111
#define CWG1STRD                      1112
#define STRD                          1113
#define OVRA                          1114
#define CWG1OVRA                      1115
#define CWG1OVRB                      1116
#define OVRB                          1117
#define OVRC                          1118
#define CWG1OVRC                      1119
#define OVRD                          1120
#define CWG1OVRD                      1121
#define SCANLADRL                     1122
#define SCANLADRL_LADR                1123
#define SCANLADRL_SCANLADR            1124
#define LADR0                         1125
#define SCANLADR0                     1126
#define SCANLADR1                     1127
#define LADR1                         1128
#define LADR2                         1129
#define SCANLADR2                     1130
#define LADR3                         1131
#define SCANLADR3                     1132
#define LADR4                         1133
#define SCANLADR4                     1134
#define LADR5                         1135
#define SCANLADR5                     1136
#define SCANLADR6                     1137
#define LADR6                         1138
#define LADR7                         1139
#define SCANLADR7                     1140
#define SCANLADRH                     1141
#define LADR8                         1142
#define SCANLADRH_SCANLADR            1143
#define SCANLADR8                     1144
#define SCANLADRH_LADR                1145
#define LADR9                         1146
#define SCANLADR9                     1147
#define LADR10                        1148
#define SCANLADR10                    1149
#define SCANLADR11                    1150
#define LADR11                        1151
#define LADR12                        1152
#define SCANLADR12                    1153
#define LADR13                        1154
#define SCANLADR13                    1155
#define LADR14                        1156
#define SCANLADR14                    1157
#define LADR15                        1158
#define SCANLADR15                    1159
#define SCANLADRU                     1160
#define LADR16                        1161
#define SCANLADR16                    1162
#define SCANLADRU_SCANLADR            1163
#define SCANLADRU_LADR                1164
#define SCANLADR17                    1165
#define LADR17                        1166
#define LADR18                        1167
#define SCANLADR18                    1168
#define LADR19                        1169
#define SCANLADR19                    1170
#define SCANLADR20                    1171
#define LADR20                        1172
#define SCANLADR21                    1173
#define LADR21                        1174
#define SCANHADRL                     1175
#define SCANHADR0                     1176
#define HADR0                         1177
#define SCANHADRL_HADR                1178
#define SCANHADRL_SCANHADR            1179
#define SCANHADR1                     1180
#define HADR1                         1181
#define SCANHADR2                     1182
#define HADR2                         1183
#define SCANHADR3                     1184
#define HADR3                         1185
#define SCANHADR4                     1186
#define HADR4                         1187
#define SCANHADR5                     1188
#define HADR5                         1189
#define SCANHADR6                     1190
#define HADR6                         1191
#define SCANHADR7                     1192
#define HADR7                         1193
#define SCANHADRH                     1194
#define HADR8                         1195
#define SCANHADRH_SCANHADR            1196
#define SCANHADR8                     1197
#define SCANHADRH_HADR                1198
#define HADR9                         1199
#define SCANHADR9                     1200
#define HADR10                        1201
#define SCANHADR10                    1202
#define SCANHADR11                    1203
#define HADR11                        1204
#define HADR12                        1205
#define SCANHADR12                    1206
#define HADR13                        1207
#define SCANHADR13                    1208
#define HADR14                        1209
#define SCANHADR14                    1210
#define HADR15                        1211
#define SCANHADR15                    1212
#define SCANHADRU                     1213
#define SCANHADRU_SCANHADR            1214
#define SCANHADRU_HADR                1215
#define HADR16                        1216
#define SCANHADR16                    1217
#define SCANHADR17                    1218
#define HADR17                        1219
#define HADR18                        1220
#define SCANHADR18                    1221
#define HADR19                        1222
#define SCANHADR19                    1223
#define HADR20                        1224
#define SCANHADR20                    1225
#define SCANHADR21                    1226
#define HADR21                        1227
#define SCANCON0                      1228
#define SCANMODE0                     1229
#define SCANCON0_MODE                 1230
#define SCANCON0_MODE0                1231
#define SCANMODE                      1232
#define SCANMODE1                     1233
#define SCANCON0_MODE1                1234
#define INTM                          1235
#define SCANINTM                      1236
#define DABORT                        1237
#define SCANINVALID                   1238
#define INVALID                       1239
#define SCANCON0_BUSY                 1240
#define SCANBUSY                      1241
#define SCANCON0_GO                   1242
#define SCANGO                        1243
#define SCANCON0_EN                   1244
#define SCANEN                        1245
#define SCANTRIG                      1246
#define TSEL0                         1247
#define TSEL                          1248
#define SCANTSEL0                     1249
#define SCANTSEL                      1250
#define TSEL1                         1251
#define SCANTSEL1                     1252
#define TSEL2                         1253
#define SCANTSEL2                     1254
#define TSEL3                         1255
#define SCANTSEL3                     1256
#define MDCON0                        1257
#define MDBIT                         1258
#define BIT                           1259
#define OPOL                          1260
#define MDOPOL                        1261
#define MDOUT                         1262
#define MDCON0_OUT                    1263
#define MDEN                          1264
#define MDCON0_EN                     1265
#define MDCON1                        1266
#define MDCLSYNC                      1267
#define CLSYNC                        1268
#define MDCLPOL                       1269
#define CLPOL                         1270
#define CHSYNC                        1271
#define MDCHSYNC                      1272
#define MDCHPOL                       1273
#define CHPOL                         1274
#define MDSRC                         1275
#define SRCS0                         1276
#define MDSRCS                        1277
#define SRCS                          1278
#define MDSRCS0                       1279
#define SRCS1                         1280
#define MDSRCS1                       1281
#define SRCS2                         1282
#define MDSRCS2                       1283
#define SRCS3                         1284
#define MDSRCS3                       1285
#define MDCARL                        1286
#define CLS0                          1287
#define MDCLS                         1288
#define MDCLS0                        1289
#define CLS                           1290
#define CLS1                          1291
#define MDCLS1                        1292
#define CLS2                          1293
#define MDCLS2                        1294
#define MDCARH                        1295
#define CHS0                          1296
#define CHS                           1297
#define MDCHS                         1298
#define MDCHS0                        1299
#define CHS1                          1300
#define MDCHS1                        1301
#define CHS2                          1302
#define MDCHS2                        1303
#define ADACT0                        1304
#define ADACT                         1305
#define ADACT1                        1306
#define ADACT2                        1307
#define ADACT3                        1308
#define ADACT4                        1309
#define ADCLK                         1310
#define ADCS0                         1311
#define ADCLK_ADCS                    1312
#define ADCS1                         1313
#define ADCS2                         1314
#define ADCS3                         1315
#define ADCS4                         1316
#define ADCS5                         1317
#define ADREF                         1318
#define ADPREF                        1319
#define ADPREF0                       1320
#define ADPREF1                       1321
#define ADNREF                        1322
#define ADCON1                        1323
#define ADDSEN                        1324
#define NVCFG0                        1325
#define NVCFG1                        1326
#define PVCFG0                        1327
#define CHSN3                         1328
#define PVCFG1                        1329
#define VCFG11                        1330
#define ADGPOL                        1331
#define ADIPEN                        1332
#define ADPPOL                        1333
#define ADCON2                        1334
#define ADMD                          1335
#define ADMD0                         1336
#define ADMD1                         1337
#define ADMD2                         1338
#define ADACLR                        1339
#define ADCRS                         1340
#define ADCRS0                        1341
#define ADCRS1                        1342
#define ADCRS2                        1343
#define ADPSIS                        1344
#define ADCON3                        1345
#define ADTMD                         1346
#define ADTMD0                        1347
#define ADTMD1                        1348
#define ADTMD2                        1349
#define ADSOI                         1350
#define ADCALC                        1351
#define ADCALC0                       1352
#define ADCALC1                       1353
#define ADCALC2                       1354
#define ADACQ                         1355
#define ADACQ0                        1356
#define ADACQ1                        1357
#define ADACQ2                        1358
#define ADACQ3                        1359
#define ADACQ4                        1360
#define ADACQ5                        1361
#define ADACQ6                        1362
#define ADACQ7                        1363
#define ADCAP                         1364
#define ADCAP0                        1365
#define ADCAP1                        1366
#define ADCAP2                        1367
#define ADCAP3                        1368
#define ADCAP4                        1369
#define ADPRE0                        1370
#define ADPRE                         1371
#define ADPRE1                        1372
#define ADPRE2                        1373
#define ADPRE3                        1374
#define ADPRE4                        1375
#define ADPRE5                        1376
#define ADPRE6                        1377
#define ADPRE7                        1378
#define ADPCH                         1379
#define ADPCH0                        1380
#define ADPCH1                        1381
#define ADPCH2                        1382
#define ADPCH3                        1383
#define ADPCH4                        1384
#define ADPCH5                        1385
#define ADCON0                        1386
#define ADCON0_GO                     1387
#define DONE                          1388
#define GO_NOT_DONE                   1389
#define GO_nDONE                      1390
#define ADGO                          1391
#define GODONE                        1392
#define ADFM                          1393
#define ADFM0                         1394
#define ADCON0_ADCS                   1395
#define ADCONT                        1396
#define ADCAL                         1397
#define ADON                          1398
#define ADPREVL                       1399
#define ADPREV0                       1400
#define ADPREV1                       1401
#define ADPREV2                       1402
#define ADPREV3                       1403
#define ADPREV4                       1404
#define ADPREV5                       1405
#define ADPREV6                       1406
#define ADPREV7                       1407
#define ADPREVH                       1408
#define ADPREV8                       1409
#define ADPREV9                       1410
#define ADPREV10                      1411
#define ADPREV11                      1412
#define ADPREV12                      1413
#define ADPREV13                      1414
#define ADPREV14                      1415
#define ADPREV15                      1416
#define ADRESL                        1417
#define ADRES0                        1418
#define ADRES1                        1419
#define ADRES2                        1420
#define ADRES3                        1421
#define ADRES4                        1422
#define ADRES5                        1423
#define ADRES6                        1424
#define ADRES7                        1425
#define ADRESH                        1426
#define ADRES8                        1427
#define ADRES9                        1428
#define ADRES10                       1429
#define ADRES11                       1430
#define ADRES12                       1431
#define ADRES13                       1432
#define ADRES14                       1433
#define ADRES15                       1434
#define ADSTAT                        1435
#define ADSTAT0                       1436
#define ADSTAT1                       1437
#define ADSTAT2                       1438
#define ADMATH                        1439
#define ADLTHR                        1440
#define ADUTHR                        1441
#define ADAOV                         1442
#define ADRPT0                        1443
#define ADRPT                         1444
#define ADRPT1                        1445
#define ADRPT2                        1446
#define ADRPT3                        1447
#define ADRPT4                        1448
#define ADRPT5                        1449
#define ADRPT6                        1450
#define ADRPT7                        1451
#define ADCNT0                        1452
#define ADCNT                         1453
#define ADCNT1                        1454
#define ADCNT2                        1455
#define ADCNT3                        1456
#define ADCNT4                        1457
#define ADCNT5                        1458
#define ADCNT6                        1459
#define ADCNT7                        1460
#define ADSTPT0                       1461
#define ADSTPTL                       1462
#define ADSTPT1                       1463
#define ADSTPT2                       1464
#define ADSTPT3                       1465
#define ADSTPT4                       1466
#define ADSTPT5                       1467
#define ADSTPT6                       1468
#define ADSTPT7                       1469
#define ADSTPT8                       1470
#define ADSTPTH                       1471
#define ADSTPT9                       1472
#define ADSTPT10                      1473
#define ADSTPT11                      1474
#define ADSTPT12                      1475
#define ADSTPT13                      1476
#define ADSTPT14                      1477
#define ADSTPT15                      1478
#define ADLTH0                        1479
#define ADLTHL                        1480
#define ADLTH1                        1481
#define ADLTH2                        1482
#define ADLTH3                        1483
#define ADLTH4                        1484
#define ADLTH5                        1485
#define ADLTH6                        1486
#define ADLTH7                        1487
#define ADLTH8                        1488
#define ADLTHH                        1489
#define ADLTH9                        1490
#define ADLTH10                       1491
#define ADLTH11                       1492
#define ADLTH12                       1493
#define ADLTH13                       1494
#define ADLTH14                       1495
#define ADLTH15                       1496
#define ADUTH0                        1497
#define ADUTHL                        1498
#define ADUTH1                        1499
#define ADUTH2                        1500
#define ADUTH3                        1501
#define ADUTH4                        1502
#define ADUTH5                        1503
#define ADUTH6                        1504
#define ADUTH7                        1505
#define ADUTH8                        1506
#define ADUTHH                        1507
#define ADUTH9                        1508
#define ADUTH10                       1509
#define ADUTH11                       1510
#define ADUTH12                       1511
#define ADUTH13                       1512
#define ADUTH14                       1513
#define ADUTH15                       1514
#define ADERR0                        1515
#define ADERRL                        1516
#define ADERR1                        1517
#define ADERR2                        1518
#define ADERR3                        1519
#define ADERR4                        1520
#define ADERR5                        1521
#define ADERR6                        1522
#define ADERR7                        1523
#define ADERR8                        1524
#define ADERRH                        1525
#define ADERR9                        1526
#define ADERR10                       1527
#define ADERR11                       1528
#define ADERR12                       1529
#define ADERR13                       1530
#define ADERR14                       1531
#define ADERR15                       1532
#define ADACC0                        1533
#define ADACCL                        1534
#define ADACC1                        1535
#define ADACC2                        1536
#define ADACC3                        1537
#define ADACC4                        1538
#define ADACC5                        1539
#define ADACC6                        1540
#define ADACC7                        1541
#define ADACC8                        1542
#define ADACCH                        1543
#define ADACC9                        1544
#define ADACC10                       1545
#define ADACC11                       1546
#define ADACC12                       1547
#define ADACC13                       1548
#define ADACC14                       1549
#define ADACC15                       1550
#define ADFLTR0                       1551
#define ADFLTRL                       1552
#define ADFLTR1                       1553
#define ADFLTR2                       1554
#define ADFLTR3                       1555
#define ADFLTR4                       1556
#define ADFLTR5                       1557
#define ADFLTR6                       1558
#define ADFLTR7                       1559
#define ADFLTR8                       1560
#define ADFLTRH                       1561
#define ADFLTR9                       1562
#define ADFLTR10                      1563
#define ADFLTR11                      1564
#define ADFLTR12                      1565
#define ADFLTR13                      1566
#define ADFLTR14                      1567
#define ADFLTR15                      1568
#define CRCDATL                       1569
#define DATA0                         1570
#define DATA1                         1571
#define DATA2                         1572
#define DATA3                         1573
#define DATA4                         1574
#define DATA5                         1575
#define DATA6                         1576
#define DATA7                         1577
#define CRCDATH                       1578
#define DATA8                         1579
#define DATA9                         1580
#define DATA10                        1581
#define DATA11                        1582
#define DATA12                        1583
#define DATA13                        1584
#define DATA14                        1585
#define DATA15                        1586
#define CRCACCL                       1587
#define ACC0                          1588
#define ACC1                          1589
#define ACC2                          1590
#define ACC3                          1591
#define ACC4                          1592
#define ACC5                          1593
#define ACC6                          1594
#define ACC7                          1595
#define CRCACCH                       1596
#define ACC8                          1597
#define ACC9                          1598
#define ACC10                         1599
#define ACC11                         1600
#define ACC12                         1601
#define ACC13                         1602
#define ACC14                         1603
#define ACC15                         1604
#define CRCSHIFTL                     1605
#define SHFT0                         1606
#define SHFT1                         1607
#define SHFT2                         1608
#define SHFT3                         1609
#define SHFT4                         1610
#define SHFT5                         1611
#define SHFT6                         1612
#define SHFT7                         1613
#define CRCSHIFTH                     1614
#define SHFT8                         1615
#define SHFT9                         1616
#define SHFT10                        1617
#define SHFT11                        1618
#define SHFT12                        1619
#define SHFT13                        1620
#define SHFT14                        1621
#define SHFT15                        1622
#define CRCXORL                       1623
#define X1                            1624
#define X2                            1625
#define X3                            1626
#define X4                            1627
#define X5                            1628
#define X6                            1629
#define X7                            1630
#define CRCXORH                       1631
#define X8                            1632
#define X9                            1633
#define X10                           1634
#define X11                           1635
#define X12                           1636
#define X13                           1637
#define X14                           1638
#define X15                           1639
#define CRCCON0                       1640
#define FULL                          1641
#define SHIFTM                        1642
#define ACCM                          1643
#define CRCCON0_BUSY                  1644
#define CRCGO                         1645
#define CRCCON0_EN                    1646
#define CRCEN                         1647
#define CRCCON1                       1648
